{
  "architectures": [
    "SDARForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_sdar.SDARConfig",
    "AutoModel": "modeling_sdar.SDARModel",
    "AutoModelForCausalLM": "modeling_sdar.SDARForCausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_implementation": "flex_attention",
  "bos_token_id": 151643,
  "debug": false,
  "eos_token_id": 151643,
  "ep_size": 1,
  "fuse_cross_entropy": true,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "max_position_embeddings": 32768,
  "max_window_layers": 36,
  "micro_forward": false,
  "model_type": "sdar",
  "num_attention_heads": 32,
  "num_hidden_layers": 36,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "skip_checkpoint": false,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.4",
  "use_cache": false,
  "use_deepep": false,
  "use_sliding_window": false,
  "vocab_size": 151936
}
